Упражнения по программированию
1) Напишите программу, которая преобразует время в минутах в часы и минуты.
Для значения бО создайте символическую констану посредством #define или
const. Используйте цикл while, чтобы обеспечить пользователю возможность
повторного ввода значений и для прекращения цикла, если вводится значение
времени, меньшее или равное нулю.

2) Напишите программу, которая запрашивает у пользователя ввод целого числа, а
затем выводит все целые числа, начиная с этого числа (и включая его) и заканчивая числом, которое больше введенного значения на 10 (включая его). (То есть,
если вводится число 5, то в выводе должны присутствовать числа от 5 до 15.)
Обеспечьте разделение выводимых значений

3) Напишите программу, которая запрашивает у пользователя ввод количества 
дней и затем преобразует это значение в количество недемь и дней. Например,
18 дней программа должна преобразовать в 2 недели и 4 дня. Отображайте результаты в следующем формате:
18 дней составляют 2 недели и 4 дня.
Чтобы пользователь мог многократно вводить количество дней, используйте цикл while. 
Цикл должен завершаться при вводе пользователем неположительного значения, например, О или -20.

4)  Напишите программу, которая запрашивает у пользователя ввод значения высоты в сантиметрах, 
после чего отображает высоту в сантиметрах, а также в футахи дюймах. Должны быть разрешены дробные части сантиметров и дюймов.
Программа должна позволить пользователю продолжать ввод значений высоты до тех пор, 
пока не будет введено неположительное значение. Вывод этой программы должен иметь следующий вид:
Введите высоту в сантиметрах: 182 
182. О см = 5 футов, 11.7 дюймов
Введите высоту в сантиметрах (<=О для выхода из программы) : 168
168.0 см = 5 футов, 6.4 дюймов
Введите высоту в сантиметрах (<=О для выхода из программы) : О 
Работа завершена.

5) #include <iostream>

using namespace std;

int main()
{
   
	int count, sum; /* оператор объявления */
	count = 0; /* оператор присваивания */
	sum = 0; /* оператор присваивания */
	while (count++ < 20) /* оператор */
   	 sum = sum + count; /* while */
	printf("sum = %d\n", sum); /* оператор вызова функции */
	return 0; /* оператор возврата */
}

Внесите изменения в программу , которая вычисляет
сумму первых 20 целых чисел. Модифицируйте программу так, 
чтобы можно было интерактивно указать, насколько далеко должно распространяться вычисление.

6) Напишите программу для вывода таблицы, в каждой строке которой представлено целое число, его квадрат и его куб. Запросите у пользователя верхний и 
нижний пределы таблицы.

7) Y делает вклад в сумме $200 под простые 10%. (То есть ежегодный прирост 
вклада составляет 10% от первоначальной суммы.) Z вкладывает $200 под 
сложные 5%. (Это значит, что ежегодное увеличение вклада составляет 5% от 
текущего баланса, включающего предыдущий прирост вклада.) Напишите программу, которая вычисляет, сколько нужно лет, чтобы сумма на счету Z 
превзошла сумму на счету Y. Выведите также размеры обоих вкладов на тот момент

8) Q выиграл миллион $, который он поместил на счет со ставкой 8% годовых. В последний день каждого года Q 
снимает со счета по $100 ООО. Напишите программу, которая вычисляет, сколько лет пройдет до того, как на счету Q не останется денег.

9) Напишите программу, которая запрашивает количество часов, отработанных за неделю, 
и выводит значения общей суммы начислений, налогов и чистой зарплаты. Исходите из перечисленных ниже утверждений.
а. Основная тарифная ставка заработной платы = $10,00/час
б. Сверхурочные часы (превышающие 40 часов в неделю) = коэффициент 1,5
в. Налоговая ставка:	15% с первых $300;
			20% со следующих $150;
			25% с остатка

10) Повторение контрольных вопросов презентаций.
